Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.DownloadFinished
Indicates if all data downloads are finished.
Since:
2018

Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.FullDownload
Indicates if download the full data of the document, which will take longer than subsequent downloads.
Since:
2018

Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.CreatingCloudSharedLocal
Indicates if it is creating cloud shared local model.
Since:
2018

Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs.#ctor(Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs
The event arguments used during creating related file phase of Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged in model open operation.
Since:
2018